; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_9_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 - counter
	)
  (:init
		(= (value c0) 73)
	(= (value c1) 67)
	(= (value c2) 16)
	(= (value c3) 0)
	(= (value c4) 45)
	(= (value c5) 81)
	(= (value c6) 35)
	(= (value c7) 14)
	(= (value c8) 25)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
		)
	)
)

; plan
1. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 3 of 8
2. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 3 of 8
3. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 3 of 8
4. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 3 of 8
5. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 3 of 8
6. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 3 of 8
7. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 3 of 8
8. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 3 of 8
9. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 3 of 8
10. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 3 of 8
11. (decrement c0)
   changed: (value c0) from 73 to 69
   goals met: 3 of 8
12. (decrement c0)
   changed: (value c0) from 69 to 65
   goals met: 4 of 8
13. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 8
14. (decrement_rate c2)
   changed: (rate_value c2) from 1 to 0
   goals met: 4 of 8
15. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 8
16. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 8
17. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 8
18. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 4 of 8
19. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 8
20. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 4 of 8
21. (decrement_rate c2)
   changed: (rate_value c2) from 1 to 0
   goals met: 4 of 8
22. (increment c7)
   changed: (value c7) from 14 to 19
   goals met: 4 of 8
23. (increment c7)
   changed: (value c7) from 19 to 24
   goals met: 4 of 8
24. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 4 of 8
25. (increment c7)
   changed: (value c7) from 24 to 30
   goals met: 3 of 8
26. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 3 of 8
27. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 3 of 8
28. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 3 of 8
29. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 3 of 8
30. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 3 of 8
31. (increment c3)
   changed: (value c3) from 0 to 5
   goals met: 3 of 8
32. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 3 of 8
33. (increment c3)
   changed: (value c3) from 5 to 11
   goals met: 3 of 8
34. (increment c3)
   changed: (value c3) from 11 to 17
   goals met: 4 of 8
35. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 8
36. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 4 of 8
37. (decrement c1)
   changed: (value c1) from 67 to 60
   goals met: 3 of 8
38. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 3 of 8
39. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 3 of 8
40. (increment c1)
   changed: (value c1) from 60 to 67
   goals met: 4 of 8
41. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 8
42. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 8
43. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 4 of 8
44. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 4 of 8
45. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 4 of 8
46. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 8
47. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 4 of 8
48. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 4 of 8
49. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 4 of 8
50. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 4 of 8
51. (decrement c7)
   changed: (value c7) from 30 to 24
   goals met: 5 of 8
52. (increment c6)
   changed: (value c6) from 35 to 41
   goals met: 5 of 8
53. (increment c6)
   changed: (value c6) from 41 to 47
   goals met: 5 of 8
54. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 5 of 8
55. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 5 of 8
56. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 5 of 8
57. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 5 of 8
58. (increment c7)
   changed: (value c7) from 24 to 34
   goals met: 4 of 8
59. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 4 of 8
60. (increment c6)
   changed: (value c6) from 47 to 54
   goals met: 4 of 8
61. (increment c6)
   changed: (value c6) from 54 to 61
   goals met: 4 of 8
62. (increment c6)
   changed: (value c6) from 61 to 68
   goals met: 4 of 8
63. (decrement c5)
   changed: (value c5) from 81 to 77
   goals met: 4 of 8
64. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 4 of 8
65. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 4 of 8
66. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 4 of 8
67. (decrement c5)
   changed: (value c5) from 77 to 73
   goals met: 4 of 8
68. (decrement c5)
   changed: (value c5) from 73 to 69
   goals met: 4 of 8
69. (decrement c5)
   changed: (value c5) from 69 to 65
   goals met: 5 of 8
70. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 5 of 8
71. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 5 of 8
72. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 5 of 8
73. (decrement c1)
   changed: (value c1) from 67 to 60
   goals met: 4 of 8
74. (decrement c0)
   changed: (value c0) from 65 to 61
   goals met: 4 of 8
75. (decrement c0)
   changed: (value c0) from 61 to 57
   goals met: 5 of 8
76. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 5 of 8
77. (increment c2)
   changed: (value c2) from 16 to 23
   goals met: 4 of 8
78. (increment c2)
   changed: (value c2) from 23 to 30
   goals met: 4 of 8
79. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 4 of 8
80. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 4 of 8
81. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 4 of 8
82. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 4 of 8
83. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 4 of 8
84. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 4 of 8
85. (increment c3)
   changed: (value c3) from 17 to 23
   goals met: 4 of 8
86. (increment c3)
   changed: (value c3) from 23 to 29
   goals met: 4 of 8
87. (increment c3)
   changed: (value c3) from 29 to 35
   goals met: 5 of 8
88. (decrement c7)
   changed: (value c7) from 34 to 24
   goals met: 6 of 8
89. (decrement c6)
   changed: (value c6) from 68 to 58
   goals met: 5 of 8
90. (decrement c5)
   changed: (value c5) from 65 to 61
   goals met: 5 of 8
91. (decrement c5)
   changed: (value c5) from 61 to 57
   goals met: 6 of 8
92. (increment c2)
   changed: (value c2) from 30 to 40
   goals met: 5 of 8
93. (increment c3)
   changed: (value c3) from 35 to 41
   goals met: 6 of 8
94. (decrement c1)
   changed: (value c1) from 60 to 50
   goals met: 5 of 8
95. (decrement c0)
   changed: (value c0) from 57 to 53
   goals met: 5 of 8
96. (decrement c0)
   changed: (value c0) from 53 to 49
   goals met: 6 of 8
97. (increment c7)
   changed: (value c7) from 24 to 34
   goals met: 5 of 8
98. (decrement c6)
   changed: (value c6) from 58 to 48
   goals met: 4 of 8
99. (decrement c6)
   changed: (value c6) from 48 to 38
   goals met: 4 of 8
100. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 4 of 8
101. (increment c6)
   changed: (value c6) from 38 to 48
   goals met: 4 of 8
102. (decrement c5)
   changed: (value c5) from 57 to 52
   goals met: 4 of 8
103. (decrement c5)
   changed: (value c5) from 52 to 47
   goals met: 5 of 8
104. (decrement c1)
   changed: (value c1) from 50 to 40
   goals met: 4 of 8
105. (decrement c1)
   changed: (value c1) from 40 to 30
   goals met: 5 of 8
106. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 5 of 8
107. (decrement c0)
   changed: (value c0) from 49 to 44
   goals met: 5 of 8
108. (decrement c0)
   changed: (value c0) from 44 to 39
   goals met: 5 of 8
109. (decrement c0)
   changed: (value c0) from 39 to 34
   goals met: 5 of 8
110. (decrement c0)
   changed: (value c0) from 34 to 29
   goals met: 6 of 8
111. (increment c7)
   changed: (value c7) from 34 to 44
   goals met: 6 of 8
112. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 6 of 8
113. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 6 of 8
114. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 6 of 8
115. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 6 of 8
116. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 6 of 8
117. (increment c8)
   changed: (value c8) from 25 to 30
   goals met: 6 of 8
118. (increment c8)
   changed: (value c8) from 30 to 35
   goals met: 6 of 8
119. (increment c8)
   changed: (value c8) from 35 to 40
   goals met: 6 of 8
120. (increment c8)
   changed: (value c8) from 40 to 45
   goals met: 7 of 8
121. (increment c7)
   changed: (value c7) from 44 to 54
   goals met: 7 of 8
122. (increment c8)
   changed: (value c8) from 45 to 50
   goals met: 7 of 8
123. (increment c8)
   changed: (value c8) from 50 to 55
   goals met: 8 of 8
